{"1c/1c":{"slug":"1c/1c","filePath":"1c/1c.md","title":"1С","links":[],"tags":[],"content":""},"Main":{"slug":"Main","filePath":"Main.md","title":"Main","links":[],"tags":[],"content":"Заглавная страница будущей Wiki ЦТО Горизонт. Пока пустая и единственная."},"devices/devices":{"slug":"devices/devices","filePath":"devices/devices.md","title":"Оборудование","links":[],"tags":[],"content":""},"evotor/evotor":{"slug":"evotor/evotor","filePath":"evotor/evotor.md","title":"Эвотор","links":[],"tags":[],"content":""},"frontol/frontol":{"slug":"frontol/frontol","filePath":"frontol/frontol.md","title":"Фронтол","links":[],"tags":[],"content":""},"index":{"slug":"index","filePath":"index.md","title":"Главная страница","links":["1c/1c","evotor/evotor","frontol/frontol","mark/mark","lb/lb","devices/devices"],"tags":[],"content":"Инструкций у нас 100500 на все случаи жизни, и многие передаются в виде устных сказаний. Хватит это терпеть!\nПока тут пусто, но со временем, возможно, соберем решения частых (и не очень) ошибок, инструкции, памятки в одном месте, чтобы они были под рукой.\nКатегории:\n\n1С\nЭвотор\nФронтол\nМаркировка\nЛавки Бахуса\nОборудование\n"},"lb/lb":{"slug":"lb/lb","filePath":"lb/lb.md","title":"Лавки Бахуса","links":["lb/pamyatka_nastroyka"],"tags":[],"content":"Здесь будут всякие разные записи по лавкам. Например, уже есть:\n\n\n\nНастройка новой лавки\n\n\n"},"lb/pamyatka_nastroyka":{"slug":"lb/pamyatka_nastroyka","filePath":"lb/pamyatka_nastroyka.md","title":"pamyatka_nastroyka","links":["mailto:a@bat039.ru","mailto:att@danor.ru"],"tags":[],"content":"Памятка по первоначальной настройке новой ЛБ\n===\nВАЖНО!\nВ случае, если установка производится на “чистую” систему (т.е. если НЕ раскатываете образ с облака) - необходимы дополнительные манипуляции:\n\nСоздаем пользователя (администратора) с именем Frontol и паролем qaz@@wsx\nСлужба FrontolService должна запускаться от имени этого пользователя, настраиваем и убеждаемся! (После создания пользователя идем в “Службы” - открываем FrontolService - “Вход в систему” - отмечаем пункт “С учетной записью” - “Обзор” - в поле “Введите имена выбираемых объектов” вводим “Frontol” - “Проверить имена” - вводим пароль - “Применить” - перезапускаем службу)\n\nОткрываем порты 8080 и 3050 в брандмауэере\n===\nВАЖНО!\nЕсли производим установку не на новой лавке, а переустанавливаем уже существующую - копируем со старой системы:\n\n\nпрофиль почты (\\AppData\\Roaming\\Thunderbird, папка Profiles и файл profiles.ini)\nбазу данных фронтола\nлицензии\nOpenVPN\n===\n\n⦁\tРаскатываем образ, устанавливаем УТМ (дистрибутив в загрузках);\n⦁\tПереименовываем ПК в ATT-[НомерЛавки];\n⦁\tПРОВЕРЯЕМ ID Anydesk, при необходимости переустанавливаем, чтобы не было дублей!\n⦁\t!!! В “Управлении дисками” приводим в порядок место на диске C;\n⦁\tДЛЯ ПК ТОВАРОВЕДА: в файле hosts прописываем:\n10.8.14.49\tsrv2012\n⦁\tВ 1С добавляем сканер Native API в подключаемом оборудовании\n⦁\tНастройки почты:\nАдрес почты – att[НомерЛавки]a@bat039.ru\nПароль – 706160\n⦁\tНастройки адресной книги:\nНазвание: eserv\nИмя сервера: danor.ru\nКорневой элемент: cn=ru\nПорт: 389\nИмя пользователя: att@danor.ru\nВ настройках учетной записи указываем подпись, чтобы было понятно, от какой лавки прихоит письмо!\n⦁\tНастройки Frontol:\n\n\nНастройки → Обмен данными. Убеждаемся, что обмен через e-mail неактивен.\nОбмен через каталоги → заполняем как на скриншоте, указывая номер своей лавки в поле “Каталог” параметров подключения (в примере на скриншоте - 19)\n\n\n\n\n\n\nНастройки → База данных — Идентификатор БД — меняем на номер лавки\n\n\nНастройки → РМ и оборудование — Номер магазина — меняем на номер лавки\n\n\nНастройки - Платежные системы - ЛОЯ - Свойства - Параметры АС - Идентификатор магазина — меняем на номер лавки\n\n\nЕГАИС → Организации – заполняем свои данные. СНО: на ЛБ у ООО «Лавка Бахуса», ООО «Бочонок», ООО «Дионис»  - ОСН. Для других ЛБ – УСН 15% (доход-расход).\n\n\nСБП – по умолчанию отключен. При наличии токена (ТОЛЬКО ПРИ НАЛИЧИИ ТОКЕНА ИМЕННО ДЛЯ ЭТОЙ ЛАВКИ!) – включить (РМ и оборудование → Платежные системы → СБП), в свойствах указать токен.\n\n\n⦁\tOpenVpn\nВ папку OpenVPN\\config поместить ключ (файлы .key и .crt)\n⦁\tУстанавливаем рестартер для FrontolService (Облако\\ЛБ\\ЛБ2023\\Рестартер службы FrontolService) - копируем FSRInstall.cmd и FrontolServiceR.exe, запускаем FSRInstall.cmd"},"mark/mark":{"slug":"mark/mark","filePath":"mark/mark.md","title":"Маркировка","links":[],"tags":[],"content":""}}